boat-rental-app/app/views/rentals/new.html.erb

  <br>
  <%= f.collection_select :boat_id, Boat.all, :id, :name %>
---
SELECT "boats".* FROM "boats"